# Master
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "apache-spark"
brew "awscli"
brew "bat"
brew "cmatrix"
brew "coreutils"
brew "docker-compose"
brew "dynamodb-local"
brew "figlet"
brew "findutils"
brew "gawk"
brew "geckodriver"
brew "git"
brew "git-secret"
brew "gnupg"
brew "gnu-sed"
brew "gnu-tar"
brew "gource"
brew "grep"
brew "htop"
brew "mas"
brew "mysql"
brew "mysql-client"
brew "nmap"
brew "node"
brew "openssl@3"
brew "poetry"
brew "postgresql"
brew "pyenv"
brew "scala"
brew "skim"
brew "sl"
brew "sqlite"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tree"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
cask "alfred"
cask "bettertouchtool"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "goodsync"
cask "google-chrome"
cask "iterm2"
cask "macs-fan-control"
cask "michaelvillar-timer"
cask "microsoft-teams"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "teamviewer"
cask "temurin"
cask "visual-studio-code"
cask "zoom"
mas "Bear", id: 1091189122
mas "Color Picker", id: 1545870783
mas "Dark Reader for Safari", id: 1438243180
mas "Dato", id: 1470584107
mas "Forecast Bar", id: 982710545
mas "IPEVO Annotator", id: 1237562727
mas "KnowledgeBase Builder", id: 1398145161
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NiBoard", id: 1511409657
mas "Photo Image Editor Pixelstyle", id: 1244649277
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
