tap "hacker1024/hacker1024"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "apache-spark"
brew "apr-util"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "boost"
brew "buku"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "docker-compose"
brew "eza"
brew "fd"
brew "figlet"
brew "findutils"
brew "freetds"
brew "fzf"
brew "geckodriver"
brew "git-delta"
brew "git-secret"
brew "git"
brew "glib"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "gource"
brew "graphviz"
brew "grep"
brew "guile"
brew "gum"
brew "hacker1024/hacker1024/coretemp"
brew "htop"
brew "jenv"
brew "jq"
brew "krb5"
brew "libarchive"
brew "libfido2"
brew "libpq"
brew "mas"
brew "maven"
brew "mongodb/brew/mongodb-community"
brew "mongosh"
brew "mysql-client"
brew "mysql"
brew "neofetch"
brew "nginx"
brew "nmap"
brew "nb"
brew "node"
brew "node@14"
brew "node@16"
brew "openjdk@11"
brew "openjdk@17"
brew "openldap"
brew "openssl@3"
brew "pango"
brew "pgloader"
brew "php"
brew "pipenv"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "sbcl"
brew "sbt"
brew "scala"
brew "scala@2.13"
brew "shellcheck"
brew "sl"
brew "supervisor", restart_service: true
brew "terminal-notifier"
brew "tesseract"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "tree"
brew "unbound"
brew "watch"
brew "wget"
brew "xz"
brew "yazi"
brew "zoxide"
cask "alfred"
cask "balenaetcher"
cask "bettertouchtool"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dynamodb-local"
cask "eqmac"
cask "goodsync"
cask "google-chrome"
cask "iterm2"
cask "macs-fan-control"
cask "michaelvillar-timer"
cask "microsoft-teams"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "skim"
cask "slack"
cask "teamviewer"
cask "visual-studio-code"
cask "zoom"
mas "Color Picker", id: 1545870783
mas "Dark Reader for Safari", id: 1438243180
mas "Dato", id: 1470584107
mas "Forecast Bar", id: 982710545
mas "IPEVO Annotator", id: 1237562727
mas "KnowledgeBase Builder", id: 1398145161
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "NiBoard", id: 1511409657
mas "Pixelstyle Photo Editor", id: 1244649277
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
